COOKIES_JSON_PATH = '../config/cookies.json'
REQUEST_USER_AGENT = 'Mozilla/5.0 (X11; Ubuntu; Linux x86_64; rv:109.0) Gecko/20100101 Firefox/114.0'
JOBINJA_JOBS_URL = 'https://jobinja.ir/jobs'

URL_FILTERS = {
    'categories': tuple(),
    'locations': tuple(),
    'keywords': str()
}

JOB_CATEGORIES = ('فروش و بازاریابی', 'وب،\u200c برنامه\u200cنویسی و نرم\u200cافزار', 'مالی و حسابداری', 'مسئول دفتر، '
                                                                                                         'اجرائی و '
                                                                                                         'اداری',
                  'دیجیتال مارکتینگ', 'IT / DevOps / Server', 'پشتیبانی و امور مشتریان', 'تولید و مدیریت محتوا',
                  'طراحی', 'مهندسی صنایع و مدیریت صنعتی', 'خرید و بازرگانی', 'مهندسی برق و الکترونیک', 'منابع انسانی '
                                                                                                       'و کارگزینی',
                  'آموزش', 'مهندسی عمران و معماری', 'کارگر ساده، نیروی خدماتی', 'مهندسی مکانیک و هوافضا',
                  'انبارداری', 'تکنسین فنی، تعمیرکار', 'گردشگری', 'حوزه\u200c سینما و تصویر', 'مدیر محصول',
                  'پزشکی،\u200c پرستاری و دارویی', 'حمل و نقل', 'تحقیق بازار و تحلیل اقتصادی', 'کارگر ماهر، کارگر '
                                                                                               'صنعتی',
                  'کارشناس حقوقی،\u200c وکالت', 'روابط عمومی', 'تحقیق و توسعه', 'مهندسی شیمی و نفت', 'ترجمه',
                  'صنایع غذایی', 'راننده، پیک موتوری', 'HSE', 'هتلداری', 'نگهبان', 'مدیریت بیمه', 'مهندسی معدن و '
                                                                                                  'متالورژی',
                  'شیمی، داروسازی', 'مهندسی پزشکی', 'علوم زیستی و آزمایشگاهی', 'مهندسی نساجی، طراحی پارچه و لباس',
                  'خبر\u200cنگاری', 'مهندسی کشاورزی', 'CEO', 'تربیت بدنی', 'مهندسی پلیمر', 'حوزه\u200c موسیقی و صدا')


LOCATIONS = ('تهران', 'خراسان رضوی', 'اصفهان', 'البرز', 'فارس'
             , 'قم', 'آذربایجان شرقی', 'مازندران', 'گیلان', 'خوزستان'
             , 'یزد', 'قزوین', 'مرکزی', 'کرمان', 'هرمزگان',
             'گلستان', 'آذربایجان غربی', 'سمنان', 'سیستان و بلوچستان',
             'بوشهر', 'زنجان', 'همدان', 'کرمانشاه', 'اردبیل',
             'خراسان جنوبی', 'کردستان', 'لرستان', 'چهارمحال بختیاری',
             'ایلام', 'کهکیلویه و بویراحمد', 'خراسان شمالی')

